---
kind: type
id: T:Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution
source: html/ff11f9f7-dd13-7b1b-a7ee-0d1703f7cc75.htm
---
# Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution

This class encapsulates a hemispherical light distribution.

## Syntax (C#)
```csharp
public class HemisphericalLightDistribution : LightDistribution
```